// №27 Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12
// (задание со *) Сделать оценку времени алгоритма через вещественные числа и строки

// Вводим данные
int ReadData(string msg)
{
    Console.WriteLine(msg);
    int num = int.Parse(Console.ReadLine() ?? "0");
    return num;
}

int SumDigith(int num)
{
    int res = 0;
    while (num > 0)
    {
        res = res + num % 10;
        num = num / 10;
    }
    return res;
}

int num = ReadData("Введите число: ");
int res = SumDigith(num);

PrintResult("Сумма цифр в числе " + num + " Равна " + SumDigith(num));

// Печатаем результат
void PrintResult(string msg)
{
    Console.WriteLine(msg);
}