//     ЗАДАЧА №20
// Напишите программу, которая принимает на вход координаты двух точек
// и находит растояние между ними в 2D пространстве.

// 1) ReadData
// 2) Calc2DDist
// 3) PrintResult


int X1 = ReadData("Введите координту X1: ");
int X2 = ReadData("Введите координту X2: ");
int Y1 = ReadData("Введите координту Y1: ");
int Y2 = ReadData("Введите координту Y2: ");


// double findDistance(int X1, int X2, int Y1, int Y2)
// {
//     return Math.Sqrt(Math.Pow (X1 - X2, 2) + Math.Pow (Y1 - Y2, 2));
// }

// int X1 = int.Parse(Console.ReadLine() ?? "0");
// int X2 = int.Parse(Console.ReadLine() ?? "0");
// int Y1 = int.Parse(Console.ReadLine() ?? "0");
// int Y2 = int.Parse(Console.ReadLine() ?? "0");

// Console.WriteLine(findDistance(X1, X2, Y1, Y2));